<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6beeb029b14519572a74c73c0fe62d3c22e05d31c0e05356d39f9894fecd833c","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #633 at https://github.com/cal-itp/data-infra/actions/runs/17771572800","plan_out_hash":"1698282711c97e4e14f31fc6c992646fcda1b07ca890119b1c33f201241d8fe9","plan_hash":"a86b12c97e4ab17586dc8e276cf72e1a5acddbda45de9dc7a5b4e1bd70d6b573","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/ntd_data_products/historical__major_safety_events.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "E5PdCQ==" -> (known after apply)
!~      detect_md5hash      = "JjV4YDCfcSmwlbTzHvM9KQ==" -> "different hash"
!~      generation          = 1749661092598055 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/ntd_data_products/historical__major_safety_events.yml"
!~      md5hash             = "JjV4YDCfcSmwlbTzHvM9KQ==" -> (known after apply)
        name                = "dags/create_external_tables/ntd_data_products/historical__major_safety_events.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_api/safety_service_and_security_historical/major_safety_events.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "gdRF8g==" -> (known after apply)
!~      detect_md5hash      = "IUhAPOvqBfKXTpJRaz+KKQ==" -> "different hash"
!~      generation          = 1751997655886500 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_api/safety_service_and_security_historical/major_safety_events.yml"
!~      md5hash             = "IUhAPOvqBfKXTpJRaz+KKQ==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/safety_service_and_security_historical/major_safety_events.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "EOeh1w==" -> (known after apply)
!~      detect_md5hash      = "u/WS3gWQKdIK3VZitwhz8g==" -> "different hash"
!~      generation          = 1751950420157727 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"
!~      md5hash             = "u/WS3gWQKdIK3VZitwhz8g==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #633](https://github.com/cal-itp/data-infra/actions/runs/17771572800)